app/controllers/fullurls_controller.rb

SELECT `fullurls`.* FROM `fullurls`
---
  def index
    @fullurls = Fullurl.all

INSERT INTO `fullurls` (`url_string`, `created_at`, `updated_at`) VALUES ('http://www.elespectador.com/noticias', '2016-08-30 20:24:46', '2016-08-30 20:24:46')
---
  def create
    @fullurl = Fullurl.new(fullurl_params)

    respond_to do |format|
      if @fullurl.save

DELETE FROM `fullurls` WHERE `fullurls`.`id` = 1
---
  def destroy
    @fullurl.destroy

SELECT  `fullurls`.* FROM `fullurls` WHERE `fullurls`.`id` = 1 LIMIT 1
---
    def set_fullurl
      @fullurl = Fullurl.find(params[:id])