app/controllers/shorturls_controller.rb

SELECT `shorturls`.* FROM `shorturls`
---
  def index
    @shorturls = Shorturl.all